load-test.yml
config:
  target: "http://localhost:4444"
  phases:
    - duration: 60         
      arrivalRate: 100     
scenarios:
  - name: "Login Test"
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "user@gmail.com"
            password: "user123"

  - name: "Get Posts Test"
    flow:
      - get:
          url: "/posts"